// lib/planOfYearConfig.ts

export type KafaaQaaidiya = {
  title: string
  mouashirat: string[]
  ahdafTaalamuiya: string[]
  sports: Record<string, { mayaeer: string[] }>  // ← add this
}

export type PlanOfYearData = {
    kafaaKhitamiya: string
    kafaatQaaidiya: KafaaQaaidiya[]
}

export const planOfYearConfig: Record<string, PlanOfYearData> = {
    s1: {
        kafaaKhitamiya: 'تنسق وتكييف مختلف العمليات الفردية والجماعية حسب إيقاع معين، مسافة معينة، شدة معينة.',
        kafaatQaaidiya: [
            {
                title: 'الكفاءة القاعدية الأولى: تبني وتيرات قاعدية وتكييف المجهودات حسب الوضعيات والحالات التي يفرضها الموقف.',
                mouashirat: [
                    'التحكم في إيقاع في وتيرة',
                    'التحكم في تعديل وتكييف مجهود',
                    'تعديل وتكييف الحركة حسب الوضعية والموقف',
                    'ربط عمليات، حركات، مهارات تتجاوب مع الوضعية والموقف',
                    'التحكم في وضعيات المواجهة فرديا وجماعيا',
                    'توقع عمليات الخصم والزميل',
                ],
                ahdafTaalamuiya: [
                    'استثمار الفضاءات الحرة بانتظام للقيام بهجوم جماعي أو فردي سريع والقذف في المرمى',
                    'اكتساب أكبر سرعة ممكنة والمحافظة عليها لقطع مسافة معينة',
                ],
                sports: {
                    sprint: {
                        mayaeer: [
                            'مختلف أشكال الاستجابة للانطلاق',
                            'انطلاق انفجاري بأو بدون ساندين',
                            'التدرج في استقامة الجسم وأخذ الوضعية المناسبة',
                            'ترداد الخطوات واتزانها واتساعها',
                            'التنسيق بين الأطراف ووضعها على محور الجري',
                            'الإنهاء السريع وتخطي خط الوصول',
                        ]
                    },
                    basketball: {
                        mayaeer: [
                            'عدد التمريرات قبل الرمي',
                            'عدد الأهداف أو النقاط المسجلة',
                            'مدة فترة الهجوم',
                            'استثمار الفضاء الحر',
                            'مشاركة عناصر الفريق في الهجوم',
                            'تضييع الكرات',
                            'الاستحواذ على الكرات',

                        ],
                    }
                },
            },
            {
                title: 'الكفاءة القاعدية الثانية: تجنيد الطاقة اللازمة (هوائية، لا هوائية) لبذل مجهود يضمن مشاركة إيجابية وأداء ذو صبغة جمالية.',
                mouashirat: [
                    'تجنيد الطاقة وصرفها في الوقت المناسب',
                    'استثمار مختلف منابع الطاقة خلال بذل المجهود',
                    'بذل مجهودات بمختلف الشدات',
                    'تنويع الاستجابات حسب ما يقتضيه الموقف (هجوم مركز، هجوم مضاد، وقت التحول من الهجوم للدفاع والعكس)',
                    'القيام بمختلف الأدوار ضمن الفريق',
                    'أداء حركات بارتياح ورشاقة',
                ],
                ahdafTaalamuiya: [
                    'تجنب المراقبة والمضايقة لمساعدة حامل الكرة والمشاركة في فترات اللعب',
                    'تجنيد وتسلسل القوة واستثمار الدفع لتحقيق أفضل نتيجة ممكنة',
                ],
                sports: {
                    throw: {
                        mayaeer: [
                            'التوازن وأخذ الوضعية',
                            'اندفاع الاقتراب',
                            'الدفع بكامل أطراف الجسم',
                            'مسلك الرمي',
                            'مسار الرمي',
                            'استعادة التوازن',
                        ]
                    },
                    handball: {
                        mayaeer: [
                            'القيام بدور السند والدعم والتغطية لحامل الكرة',
                            'سد العجز والخلل في حالة النقص العددي',
                            'العمل على تغيير الأماكن والتحول إلى حالة التفوق العددي',
                            'المساهمة في الهجوم الجماعي',
                            'المساهمة في الدفاع الجماعي',

                        ],
                    }
                },
            },
            {
                title: 'الكفاءة القاعدية الثالثة: تنسيق وتسيير المجهودات فرديا وجماعيا حسب مدة وشدة التنافس.',
                mouashirat: [
                    'ضبط المجهود وضبط صيغة المواجهة',
                    'تنظيم سعة الخطوة، تنظيم الوتيرة والإيقاع',
                    'قبول المواجهة',
                    'تنظيم فترة الهجوم أو الدفاع',
                    'تسيير مجهود فردي أو جماعي لفترة معينة وحسب الموقف',
                ],
                ahdafTaalamuiya: [
                    'المساهمة في اللعب الجماعي والمحافظة على الدور والدفاع والهجوم',
                    'استثمار القوى المناسبة للوثب لتحقيق أحسن نتيجة ممكنة',
                ],
                sports: {
                    longJump: {
                        mayaeer: [
                            'التحكم في خطوات الاقتراب',
                            'الدفع والارتقاء المناسبين (لوح الارتقاء، منطقة الارتقاء)',
                            'التحكم في الجسم وعمل الأطراف أثناء الطيران',
                            'الاستقبال المناسب والمتزن',
                            'ربط وتنسيق مراحل الوثب',
                        ]
                    },
                    vollyball: {
                        mayaeer: [
                            'المشاركة الفعالة في عملية هجومية أو دفاعية',
                            'ضمان دور التغطية والدعم والسند',
                            'احترام قواعد اللعب',
                            'تعديل وتكييف الهجوم حسب الموقف الدفاعي',
                            'تعديل وتكييف الدفاع حسب الموقف الهجومي',
                            'تسيير أو تنسيق هجوم أو دفاع',
                        ],
                    }
                },
            },
        ],
    },

    s2: {
        kafaaKhitamiya: 'تكييف وترشيد الاستجابات الحركية حسب صيغة وشكل الواجهة في وضعيات متعلقة بالمسافة، بالشدة، بالمدة، بالفضاء.',
        kafaatQaaidiya: [
            {
                title: 'الكفاءة القاعدية الأولى: تقبل المواجهة فرديا وجماعيا والمشاركة الفعالة لتحقيق الفوز أو تحسين نتيجة رياضية.',
                mouashirat: [
                    'تقبل التنافس وجها لوجه (رجل لرجل)',
                    'محاصرة مباشرة للخصم',
                    'تقبل مسايرة وتيرة معينة',
                    'مسايرة تغير إيقاع',
                    'التفوق على نظام دفاعي معين',
                    'مضايقة خصم للاستحواذ على الكرة',
                    'مضايقة خصم أثناء الجري لتجاوزه',
                    'الدفاع الجماعي عن مرمى، عن منطقة',
                ],
                ahdafTaalamuiya: [
                    'المشاركة في منافسة باعتماد مبادئ المحاصرة والمضايقة وبعث الخلل لتسجيل أهداف أو نقاط تضمن التفوق',
                    'التنافس من أجل الفوز أو مساعدة الزميل للفوز باحترام قواعد المواجهة النبيلة',
                ],
                sports: {
                    sprint: {
                        mayaeer: [
                            'تقدير مستوى المنافسة',
                            'تحقيق عملية لمرات عديدة (نفس المسافة، نفس الوقت)',
                            'تحسين نتيجة (وقت، مسافة)',
                            'مساعدة زميل للفوز أو لتحسين نتيجة',
                        ]
                    },
                    basketball: {
                        mayaeer: [
                            'تنفيذ عملية المحاصرة بنجاح',
                            'تجاوز الخصم بنجاح',
                            'التخلص من المحاصرة',
                            'احتلال المناطق الحرة في الهجوم',
                            'احتلال المناطق الحساسة في الدفاع',

                        ],
                    }
                },
            },
            {
                title: 'الكفاءة القاعدية الثانية: الاندماج في الفوج والقيام بالدور المنوط به والمساهمة البناءة في المردود الفردي والجماعي.',
                mouashirat: [
                    'تقبل القيام بمختلف الأدوار',
                    'المساهمة الفعالة ضمن الفوج',
                    'اقتراح الحلول المناسبة',
                    'المبادرة',
                    'مساعدة الزميل في الدفاع والهجوم',
                    'توقع عمليات الخصم وتبليغها للزملاء',
                    'تقبل التوجيهات والنصائح',
                ],
                ahdafTaalamuiya: [
                    'ربط وتسلسل عمليات لبلوغ منطقة الخصم أو للدفاع عن المنطقة',
                    'الجري حسب الفرق (تتابع مداومة)، الرمي والوثب حسب الفرق، والعمل على تطوير النتائج',
                ],
                sports: {
                    throw: {
                        mayaeer: [
                            'العمل على بذل أكبر مجهود في خدمة الفريق',
                            'تجنب الأخطاء والتقليل منها',
                            'استثمار المحاولات لتطوير النتائج',
                            'تحفيز الزملاء وإرشادهم',
                        ]
                    },
                    handball: {
                        mayaeer: [
                            'القيام بدور السند والدعم والتغطية لحامل الكرة',
                            'سد العجز والخلل في حالة النقص العددي',
                            'التحكم في مداعبة الكرة',
                            'التحكم في التنقل بالكرة',
                            'التحكم في التصدي للخصم والكرة',
                            'التواجد في المناطق الحساسة في الدفاع والهجوم',
                        ],
                    }
                },
            },
            {
                title: 'الكفاءة القاعدية الثالثة: اختيار وتطبيق خطة جماعية أو فردية للمحافظة على نتيجة رياضية أو تحسينها.',
                mouashirat: [
                    'اختيار عملية هجومية عن طريق التخلص من المحاصرة',
                    'احتلال منطقة استراتيجية في الهجوم',
                    'إحداث وضعية تفوق عددي',
                    'اختيار وضعيته ضمن أسلوب معين من اللعب',
                    'تغيير الإيقاع لمضايقة الخصم',
                    'وضع خطة لمهاجمة الخصم خلال الجري',
                    'مساعدة الزميل لاجتياز حاجز أو تحقيق رمية',
                ],
                ahdafTaalamuiya: [
                    'استثمار فضاءات معينة خلال التنقل بالكرة أو بدونها وإنهاء الهجوم بالتصويب',
                    'اختيار المعالم الضرورية لتحقيق رمية، وثبة، أو قطع مسافة في أحسن الظروف',
                    
                ],
                sports: {
                    longJump: {
                        mayaeer: [
                            'حساب الاقتراب',
                            'التحكم في خطوات الاقتراب',
                            'الدفع والارتقاء المناسبين (لوح الارتقاء، منطقة الارتقاء)',
                            'التحكم في الجسم وعمل الأطراف أثناء الطيران والاستقبال',
                            'التوازن بعد الرمي',
                            'تسلسل الدفع',
                            'الانطلاق الانفجاري',
                            'المحافظة على الجري في المحور',
                            'الجري ضمن فريق',
                        ]
                    },
                    vollyball: {
                        mayaeer: [
                            'المشاركة الفعالة في عملية هجومية',
                            'اختيار مسالك التنقل',
                            'ضمان التبادل للكرات',
                            'تغيير مسالك التنقل بالكرة حسب المستجدات',
                            'تسيير أو تنسيق هجوم',
                        ],
                    }
                },
            },
        ],
    },

    s3: {
        kafaaKhitamiya: 'أن يتمكن المتعلم من ضبط الاستجابات السلوكية مع تنويع أشكال وشدة الحركة قصد تحسين نتيجة أو منتوج رياضي ذو صبغة جمالية.',
        kafaatQaaidiya: [
            {
                title: 'الكفاءة القاعدية الأولى: أن يتمكن المتعلم من الاستجابة المناسبة فرديا وجماعيا لمواجهة المؤثرات أو المواقف التي يفرضها الوضع.',
                mouashirat: [
                    'القيام بدور فعال في الدفاع بمحاصرة الخصم المباشر',
                    'الاستجابة السريعة لمؤثر',
                    'القيام بدور فعال في الهجوم بالتخلص من المحاصرة واستثمار الفضاء الحر',
                    'تنسيق جيد بين الاقتراب والوثب',
                    'تبني وتيرات وإيقاع مكيفين لنوعية العمل',
                ],
                ahdafTaalamuiya: [
                    'محاصرة الخصم أو التخلص من المحاصرة والتحول المناسب من الدفاع إلى الهجوم والعكس',
                    'تحقيق قطع مسافة، وثبة، رمية بطريقة قانونية',
                ],
                sports: {
                    sprint: {
                        mayaeer: [
                            'تنفيذ انطلاق ناجح والمحافظة على تدرج استقامة الجسم',
                            'الجري الاستعدادي ومنطقة الارتقاء',
                            'تجنيد القوى والدفع الكامل للأداة',
                            'تنفيذ رميات ووثبات ناجحة وصحيحة',
                        ]
                    },
                    basketball: {
                        mayaeer: [
                            'خلق وضعية تفوق عددي',
                            'تضييق المجالات في الدفاع لمحاصرة الخصم',
                            'مضايقة خصم مباشر دون ارتكاب أخطاء',
                            'التحول المناسب من وضعية لأخرى',
                            'فهم الموقف والتصدي له',
                        ],
                    }
                },
            },
            {
                title: 'الكفاءة القاعدية الثانية: أن يتمكن المتعلم من تنويع التدخلات بمجهودات مناسبة لضمان أفضل نتيجة.',
                mouashirat: [
                    'تسيير مجهود للرفع من حدود المقدرة',
                    'تنسيق عمليات فردية لضمان المحافظة على نتيجة أو تحسينها',
                    'الضغط على الخصم وتوقع عملياته قصد قنص الكرة',
                    'ضمان السند والدعم في وضعيات تنافسية',
                    'المساهمة الفعالة في نظام لعب من حيث: القيام بمختلف الأدوار، المحاصرة الصارمة للخصم، تغيير خطط أو استراتيجيات',
                ],
                ahdafTaalamuiya: [
                    'المشاركة في منافسة والقيام بأدوار دفاعية وهجومية',
                    'أداء منافسة فردية قصد تحسين نتائجه الرياضية في حدود القانون',
                ],
                sports: {
                    longJump: {
                        mayaeer: [
                            'وضعية الجسم والمحافظة على محور الجري',
                            'البحث على السرعة القصوى',
                            'حساب الاقتراب واحترام منطقة الارتقاء',
                            'الاندفاع الانسيابي المسطح في الرمي',
                            'اختيار أسلوب الوثب أو الرمي',
                        ]
                    },
                    handball: {
                        mayaeer: [
                            'الدفاع فرد مقابل فرد',
                            'سد العجز والخلل في حالة النقص العددي',
                            'مضايقة الخصم في الدفاع والهجوم ومتابعة تحركات الخصم',
                            'التفوق العددي انطلاقا من وضعية الخصم',
                            'التحكم في التصدي للخصم والكرة',
                            'التواجد في المناطق الحساسة في الدفاع والهجوم',
                        ],
                    }
                },
            },
            {
                title: 'الكفاءة القاعدية الثالثة: أن يتمكن المتعلم من تجنيد وتسيير طاقاته لتحقيق أفضل نتيجة.',
                mouashirat: [
                    'الجري في حدود وقت معين، مسافة محسوبة',
                    'تعديل وتيرة، شدة حسب نوعية ومرحلة الجري',
                    'تحقيق نتيجة، تحسن متعلق بمقياس',
                    'حصر مخاطر موقف وتجنيد طاقاته لتحقيق أفضل نتيجة',
                    'تعديل المجهودات في الهجوم والدفاع لمواجهة الخصم',
                    'تسيير نتيجة والمحافظة عليها خلال المنافسة',
                ],
                ahdafTaalamuiya: [
                    'القيام بالسند والتغطية في الدفاع والهجوم بما يناسب مواقع اللعب',
                    'تحقيق نتيجة رياضية بتجنيد مختلف منابع الطاقة وبما يتماشى ومقياس التنقيط',
                   
                ],
                sports: {
                    throw: {
                        mayaeer: [
                            'الجري بإيقاع تصاعدي متدرج',
                            'احترام صيغة التنفيذ',
                            'توزيع الطاقة وبذل المجهود',
                            'تنسيق مراحل وثبة أو رمية',
                            'استثمار كامل طاقاته خلال الرمي أو الوثب',
                        ],
                    },
                    vollyball: {
                        mayaeer: [
                            'احترام مركبات خطة وتنفيذها في الوقت المناسب',
                            'قص الكرات والاستحواذ عليها في منطقة الخصم',
                            'الضغط على الخصم ومباغتته',
                            'خلق أكبر قدر من التفوق العددي',
                        ],
                    }
                },
            },
        ],
    },
}